/**
 * জাভাস্ক্রিপ্টে, অ্যারে হলো একটি গ্লোবাল অবজেক্ট যা একটি একক ভেরিয়েবলে একাধিক মান সংরক্ষণ করতে ব্যবহৃত হয়। 
 * অ্যারে হলো তথ্যের ক্রমানুসারে সংগ্রহ, যেখানে প্রতিটি মান একটি উপাদান এবং একটি সংখ্যাসূচক অবস্থান নির্ধারণ করা হয়
 * যাকে সূচক বলা হয়। জাভাস্ক্রিপ্ট অ্যারেতে ইনডেক্স শূন্য থেকে শুরু হয়।
 * 
 * অ্যারের আক্ষরিক: অ্যারে তৈরি করার সবচেয়ে সাধারণ উপায় হল বর্গাকার বন্ধনী []ব্যবহার করা ।
 * 
 */

let fruits = ["apple", "banana", "cherry"];
let numbers = [1, 2, 3, 4, 5];
let mixed = [1, "hello", true, { key: "value" }]; // Arrays can hold mixed data types