// ভ্যারিয়েবল কী?
// সংজ্ঞা: একটি ভ্যারিয়েবল হলো মেমোরির একটি নামযুক্ত স্থান, যেখানে একটি মান (value) সংরক্ষণ করা হয়।
// উদাহরণ: একটি বাক্সের মতো চিন্তা করুন যার একটি নাম আছে (যেমন X) এবং তার মধ্যে আপনি একটি জিনিস (যেমন Pizza) রাখতে পারেন। প্রোগ্রামিং-এর ভাষায়, এটি লেখা হয় X = Pizza।
// পরিবর্তনশীলতা: ভ্যারিয়েবল-এর মান প্রোগ্রামের যেকোনো সময় পরিবর্তন করা যায়। একটি নতুন মান অ্যাসাইন করলে আগের মানটি মুছে যায়।
// ব্যবহার: ভ্যারিয়েবল ডেটা সংরক্ষণ করতে, গাণিতিক অপারেশন করতে এবং প্রোগ্রামের শর্ত ও লুপ নিয়ন্ত্রণ করতে সাহায্য করে। 
var taka = 500;

console.log(taka)

// variable er mane change korbo
taka = 1000;
console.log( taka)