// 🔹 JavaScript এ Variable কি?
// ans : JavaScript এ Variable হলো একটি নামকৃত স্টোরেজ (ঘর), যেখানে আমরা ডেটা রাখতে পারি এবং পরে সেটা ব্যবহার করতে পারি।
// 🔹 Variable declare করার তিনটা উপায় আছে:

// var

// let

// /

// // var দিয়ে
// var name = "Durjoy";  
// console.log(name);

// // let দিয়ে
// let age = 20;  
// console.log(age);

// // const দিয়ে (যার মান আর পরিবর্তন করা যাবে না)
// const country = "Bangladesh";  
// console.log(country);



// 🔹 পার্থক্য

// var → পুরোনো পদ্ধতি, scope সমস্যা আছে, তাই এখন বেশি ব্যবহার হয় না।

// let → আধুনিক ও বেশি ব্যবহার হয়। মান পরিবর্তন করা যায়।

// const → স্থায়ী মান রাখার জন্য ব্যবহার হয়, মান পরিবর্তন করা যায় না।

// kono variable declare korte  fst veriable name and ter man 


// example :

var age = 20 ;

var money = 300 ;

console.log(age);

// variable er man change korte 

money = 5000 ; 
// dile hobe
console .log(money);
